head -n 20 #first 20 line 
head -c 20 #first 20 character  
head -n 22 | tail -11  # line 12 - 22 хооронд
tail -n 20 # сүүлээс 20 line-г авах.
cut -b 3 # бүх line уудын 3 дахь үсгийг нь салгаж авч байна. 
cut -c 2,7 # бүх line-уудын 2 болон 7 дахь үсгийг салгаж харуулна.
cut -b 2-7 # бүх line-уудын 2-7 дахь үсгүүдийг нийлүүлж салгаж авна. 
cut -b -4  # бүх line-уудын эхний 4 үсгийг харуулна. 
cut -f1-3 #бүх line-уудын 1-3 дугаар хоосон зайнуудын хоёр талын үгийг салгаж харуулна 
cut -c13- #эхний line-ын 13 дахь үсгээс эхлэн хойших бүх үгийг харуулна
cut -d " " -f 4 #бүх line-уудын хамгийн багадаа 4 үсэгтэй үгнүүдийг нь ялгаж харуулна. 
cut -d " " -f1-3 #бүх өгүүлбэрийн эхний 3 үгийг салгаж харуулна. 
